bases/WIM_FIn/projects/IMDEV-7330 Оптимизация 1С ФИН_Расчет НДФЛ/Расширения/IMDEV7330_Locks/DataProcessors/ФормированиеНачисленийНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеНачисленийНДФЛ</Name>
		</Properties>
	
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантЗаполнения</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>1</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйПериод</Name>
					<Type><v8:Type>cfg:CatalogRef.Периоды</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыБезУдержаний</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыПоКлиентамБезЦБ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиПо</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиС</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Период</Name>
					<Type><v8:Type>v8:StandardPeriod</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоздаватьОплатуНДФЛ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СхемаВыплаты</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>1</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетДляОплатыНалогов</Name>
					<Type><v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УправляющаяКомпания</Name>
					<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияПоЗакрытымПортфелям</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПоЗакрытымПортфелямСПоступлениемНКД</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Дата</Name>
							<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УправляющаяКомпания</Name>
							<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Клиент</Name>
							<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СхемаРеинвестирования</Name>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>20</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-7330 Оптимизация 1С ФИН_Расчет НДФЛ/Расширения/IMDEV7330_Locks/DataProcessors/ФормированиеНачисленийНДФЛ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("УправлениеФормой")
Процедура IMDEV7330_Locks_УправлениеФормой()
	
	#Вставка
	IMDEV7330_Locks_ДобавитьВариантПоОтсутствующимНачислениям();
	#КонецВставки
	Элементы.Период.Видимость = Объект.ВариантЗаполнения <> 3;
	#Удаление
	Элементы.ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ.Видимость = Объект.ВариантЗаполнения = 2;
	Элементы.СоздаватьОплатуНДФЛ.Видимость = Объект.ВариантЗаполнения = 2;
	Элементы.СхемаВыплаты.Видимость = Объект.ВариантЗаполнения = 2;
	#КонецУдаления
	#Вставка
	Элементы.ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ.Видимость =
		Объект.ВариантЗаполнения = 2 Или Объект.ВариантЗаполнения = 4;
	Элементы.СоздаватьОплатуНДФЛ.Видимость = Объект.ВариантЗаполнения = 2;
	Элементы.СхемаВыплаты.Видимость =
		Объект.ВариантЗаполнения = 2 Или Объект.ВариантЗаполнения = 4;
	#КонецВставки
	Элементы.СчетДляОплатыНалогов.Видимость = Объект.СоздаватьОплатуНДФЛ;
	
КонецПроцедуры

// Описание: Добавляет пункт «По отсутствующим Начислениям НДФЛ» и группирует тумблер горизонтально.
//
Процедура IMDEV7330_Locks_ДобавитьВариантПоОтсутствующимНачислениям()
	
	Если Элементы.ВариантЗаполнения.СписокВыбора.НайтиПоЗначению(4) = Неопределено Тогда
		Элементы.ВариантЗаполнения.СписокВыбора.Добавить(4, НСтр("ru = 'По отсутствующим Начислениям НДФЛ'"));
	КонецЕсли;
	
	Элементы.ГруппаВариантЗаполнения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элементы.ГруппаВариантЗаполнения.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры
